# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
#  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
#  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
#  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
#  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [ -1, 1, ConvBNReLU, [ 32, 3, 2 ] ]            # 0-P1/2   128*128*32

  - [ -1, 1, ConvBNReLU, [ 32, 3, 2 ] ]  # 1        64*64*32
  - [ -1, 1, ConvBNReLU, [ 32, 1, 1 ] ]  # 2-P2/4   64*64*32

  - [ -1, 1, ConvBNReLU, [ 96, 3, 2 ] ]  # 3-P2/4   32*32*96
  - [ -1, 1, ConvBNReLU, [ 64, 1, 1 ] ]  # 4-P3/8   32*32*64
#  - [-1, 2, C3k2, [64, False, 0.25]] # 5 new add

  - [ -1, 1, UniversalInverted, [ 96, 5, 5, True, 2, 3, False ] ]  # 5-P3/8   16*16*96
  - [ -1, 1, UniversalInverted, [ 96, 0, 3, True, 1, 2, False ] ]  # 6-P3/8   16*16*96
  - [ -1, 1, UniversalInverted, [ 96, 0, 3, True, 1, 2, False ] ]  # 7-P4/16  16*16*96
  - [ -1, 1, UniversalInverted,  [ 96, 0, 3, True, 1, 2, False ] ]  # 8-P4/16  16*16*96
  - [ -1, 1, UniversalInverted, [ 96, 0, 3, True, 1, 2, False ] ]  # 9-P4/16  16*16*96
  - [ -1, 1, UniversalInverted, [ 96, 3, 0, True, 1, 4, False ] ]  # 10-P4/16 16*16*96
  - [-1, 2, C3k2, [96, True]]

  - [ -1, 1, UniversalInverted, [ 128, 3, 3, True, 2, 6, True ] ]  # 11       8*8*128
  - [ -1, 1, UniversalInverted, [ 128, 5, 5, True, 1, 4, True ] ]  # 12       8*8*128
  - [ -1, 1, UniversalInverted, [ 128, 5, 5, True, 1, 4, True ] ]  # 13       8*8*128
  - [ -1, 1, UniversalInverted, [ 128, 5, 5, True, 1, 4, True ] ] # 14-P5/32  8*8*128
  - [ -1, 1, UniversalInverted, [ 128, 0, 3, True, 1, 4, True ] ] # 15-P5/32  8*8*128
  - [ -1, 1, UniversalInverted, [ 128, 0, 3, True, 1, 4, True ] ] # 16-P5/32  8*8*128
  - [-1, 2, C3k2, [128, True]]

  - [ -1, 1, ConvBNReLU, [ 960, 1, 1 ] ]  # 17       8*8*256
  - [ -1, 1, ConvBNReLU, [ 1280, 1, 1 ] ]  # 18       8*8*256
  - [-1, 1, SPPF, [1024, 5]] # 19
  - [-1, 2, C2PSA, [1024]] # 10 new add

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 10], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 22

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 25 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 25], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 28 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 22], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 31 (P5/32-large)

  - [[28, 31, 34], 1, Detect, [nc]] # Detect(P3, P4, P5)
